Sway-Light/sway-light-ht32f52352/main.c
void wsUpdateMag() {
	if (mode == 2) Light_Animation(slideValue);		// Light Mode
	else if (mode == 3) Music_Animation(slideValue);	// Music Mode
	
	startShow = TRUE;
}

void ADC_MainRoutine(void) {
	u8 i;
	u32 total = 0;
	if (gADC_CycleEndOfConversion) {
		if (adcIndex < TEST_LENGTH_SAMPLES) {
			InputSignal[adcIndex] = gADC_Result;
			InputSignal[adcIndex + 1] = 0;
			adcIndex += 2;
		} else {
			if (refFlag == TRUE) {
				for (i = 2; i < TEST_LENGTH_SAMPLES; i += 2) total += InputSignal[i];
				ref_bit = total / (TEST_LENGTH_SAMPLES / 2 - 1);
				refFlag = FALSE;
				
//				for (i = 0; i < TEST_LENGTH_SAMPLES; i += 1) printf("%d ", InputSignal[i]);
//				printf("\r\n");
//				printf("ref_bit = %d\r\n", ref_bit);
			} else {
				sampleFlag = TRUE;
			}
		}
		gADC_CycleEndOfConversion = FALSE;
	}
}

void DefineRefBit(void) {
	delay(1000000);
	ref_bit = 0;
	adcIndex = 0;
	refFlag = TRUE;
}

void RUN_FFT(void) {
	/* Process the data through the CFFT/CIFFT module */
	arm_cfft_f32(&arm_cfft_sR_f32_len64, fftData, ifftFlag, doBitReverse);

	/* Process the data through the Complex Magnitude Module for
	calculating the magnitude at each bin */
	arm_cmplx_mag_f32(fftData, OutputSignal, fftSize);
}

void speakerEnable(bool enable) {
	// Music mute pin
	// Enable  -> low
	// Disable -> high
	GPIO_WriteOutBits(HT_GPIOC, GPIO_PIN_15, (FlagStatus)!enable);
}

void calculateGradient(u8 i1, u8 i2, u8 Fst_color[], u8 Snd_color[]) {
	u8 color_level, color_rgb, value = 0;
	
	for (color_level = i1; color_level <= i2; color_level++) {
		for (color_rgb = 0; color_rgb < 3; color_rgb++) {
			
			if (Snd_color[color_rgb] > Fst_color[color_rgb]) {
				if (i2 > 3) value = Fst_color[color_rgb] + (Snd_color[color_rgb] - Fst_color[color_rgb]) / 4 * (color_level - 4);
				else value = Fst_color[color_rgb] + (Snd_color[color_rgb] - Fst_color[color_rgb]) / 4 * color_level;
			} else if (Snd_color[color_rgb] < Fst_color[color_rgb]) {
				if (i2 > 3) value = Fst_color[color_rgb] - (Fst_color[color_rgb] - Snd_color[color_rgb]) / 4 * (color_level - 4);
				else value = Fst_color[color_rgb] - (Fst_color[color_rgb] - Snd_color[color_rgb]) / 4 * color_level;
			} else {
				value = Fst_color[color_rgb];
			}
			
			musicColor[color_level][color_rgb] = value;
		}
	}
}

void generateMusicColor(u8 level) {
//	u8 color_level;
	u8 color_rgb;
	
	if (initFlag != TRUE) {
		for (color_rgb = 0; color_rgb < 3; color_rgb++) {
			if (level == 0x03) {
				musicColor[0][color_rgb] = low_color[color_rgb];
			} else if (level == 0x02) {
				musicColor[4][color_rgb] = mid_color[color_rgb];
				musicColor[5][color_rgb] = mid_color[color_rgb];
			} else if (level == 0x01) {
				musicColor[9][color_rgb] = high_color[color_rgb];
			}
		}
	}
	if (level == 0x03 || level == 0x02) calculateGradient(1, 3, musicColor[0], musicColor[4]);
	if (level == 0x01 || level == 0x02) calculateGradient(6, 8, musicColor[4], musicColor[9]);
	
//	for (color_level = 0; color_level < WS_LEV_SIZE; color_level++) {
//		printf("musicColor[%2d]: ", color_level);
//		for (color_rgb = 0; color_rgb < 3; color_rgb++) {
//			printf("%3d ", musicColor[color_level][color_rgb]);
//		}
//		printf("\r\n");
//	}
}

void DataToESP(u8 category, u8 type) {
	u8 i;
	u16 checksum = 0;
	
	data_to_esp[0] = 0x95; // Start Bit
	data_to_esp[1] = category;
	data_to_esp[2] = type;
	if (category == 0x01) {
		for (i = 3; i <= 6; i++) data_to_esp[i] = 0x00;
	} else if (category == 0x02) {
		if (type == 0x01) {
//			data_to_esp[3] = slideValue;
			for (i = 4; i <= 6; i++) data_to_esp[i] = Color[i - 4];
		} else if (type == 0x03) {
//			data_to_esp[3] = zoomValue;
			for (i = 4; i <= 6; i++) data_to_esp[i] = 0x00;
		} else if (type == 0x05) {
			data_to_esp[3] = offsetValue;
			data_to_esp[4] = zoomValue;
			
//			if (slideValue <= 0) slideValue = 0;
//			else if (slideValue >= 100) slideValue = 100;
			data_to_esp[5] = (slideValue / 255.0) * 100;
			
			data_to_esp[6] = 0x00;
		}
	} else if (category == 0x03) {
		if (type == 0x05) {
			data_to_esp[3] = offsetValue;
			data_to_esp[4] = zoomValue;
			
//			if (slideValue <= 0) slideValue = 0;
//			else if (slideValue >= 100) slideValue = 100;
			data_to_esp[5] = (slideValue / 255.0) * 100;
			
			data_to_esp[6] = 0x00;
		}
	} else if (category == 0x05) {
		if (type == 0x06) {
			data_to_esp[3] = (u8)BT_CON;
			data_to_esp[4] = (u8)BT_isPlay;
			data_to_esp[5] = (u8)BT_VOL;
			
			data_to_esp[6] = 0x00;
		}
	}
	for (i = 1; i <= 6; i++) checksum += data_to_esp[i];
	data_to_esp[7] = checksum >> 8;
	data_to_esp[8] = checksum & 0x00FF;
	data_to_esp[9] = 0x87; // End Bit
	
//	printf("Sending: [");
//	for (i = 0; i < 10; i++) printf("%02X ", data_to_esp[i]);
//	printf("]\r\n");
	
	send_index = 0;
	toEspFlag = TRUE;
	USART_IntConfig(HT_USART0, USART_INT_TXDE, ENABLE);
}

void DataFromESP(u8 command[]) {
	u8 i;
	static u8 data[4];
	
	for (i = 0; i <= 3; i++) data[i] = command[i + 3];
	
	if (command[1] == 0x01) {			// Switching Mode
//		printf("Switching Mode: \r\n");
		SwitchingMode(command[2]);
	} else if (command[1] == 0x02) {	// Lighting Mode
//		printf("Lighting Mode: \r\n");
		LightingMode(command[2], data);
	} else if (command[1] == 0x03) {	// Music Mode
//		printf("Music Mode: \r\n");
		MusicMode(command[2], data);
	} else if (command[1] == 0x04) {	// Setting
//		printf("Setting: \r\n");
		Setting(command[2], data);
	} else if (command[1] == 0x05) {	// BT_Module
//		printf("BT_Module: \r\n");
		BT_Module(command[2], data);
	}
}

void DataFromBT(u8 command[]) {
	u8 i;
	u8 data[5] = "-----", index = 0;
	u16 volume[2];
	
	for (i = 0; i < 9; i += 1) {
		if (command[i] != '\r' && command[i] != '\n' && command[i] != ' ') {
			data[index] = command[i];
//			printf("%d: '%c'\r\n", index, data[index]);
			index += 1;
		}
	}
//	printf("\n");
	
	if (data[0] == 'E' && data[1] == 'R' && data[2] == 'R') {
//		printf("The command is error.\r\n");
	} else if (data[0] == 'V' && data[1] == 'O' && data[2] == 'L') {
		for (i = 0; i < 2; i += 1) volume[i] = data[i + 3];
		if (volume[1] != '-') BT_VOL = (volume[0] - '0') * 10 + (volume[1] - '0');
		else BT_VOL = (volume[0] - '0');
		printf("Set volume: %d\r\n", BT_VOL);
	} else if (data[0] == 'M' && (data[1] == 'A' || data[1] == 'P')) {
//		printf("Music isn't playing\r\n");
		BT_isPlay = FALSE;
	} else if (data[0] == 'M' && (data[1] == 'B' || data[1] == 'R')) {
//		printf("Music is playing\r\n");
		BT_isPlay = TRUE;
	} else if (data[0] == 'I' && data[1] == 'V') {
//		printf("BT Connected");
		BT_CON = TRUE;
	} else if (data[0] == 'I' && (data[1] == 'A' || data[1] == 'I')) {
//		printf("BT Disconnected");
		BT_CON = FALSE;
	}
	if (toEspFlag == FALSE) DataToESP(0x05, 0x06);
	
//	for (i = 0; i < 9; i += 1) BLE_RX[i] = 0x20;
}

void SwitchingMode(u8 status) {	
	mode = status;
	
	if (mode == 0) {
		On_Effect(20, TRUE);
		speakerEnable(FALSE);
		
		DefineRefBit();
		
//		printf("Turn off\r\n");
	} else if (mode == 1) {
		mode = curr_mode;
		
