Sway-Light/sway-light-ht32f52352/main.c
		On_Effect(20, FALSE);
		
		if (toEspFlag != TRUE) DataToESP(0x01, mode); // Sending Status Message
		adcIndex = 0;
		speakerEnable(TRUE);
		
		wsUpdateMag();
		
//		printf("Turn on\r\n");
	} else if (mode == 2) {
		mode = 3;
		Switch_Effect(5, slideValue);
		mode = 2;
		curr_mode = mode;
		adcIndex = 0;
		
		wsUpdateMag();
	} else if (mode == 3) {
		mode = 2;
		Switch_Effect(5, slideValue);
		mode = 3;
		curr_mode = mode;
	}
}

void LightingMode(u8 type, u8 data[]) {
	u8 i;
	
	L_Type = type;
	if (L_Type == 0x01) {
		Brightness = data[0];
//		slideValue = Brightness;
		
		for (i = 0; i < 3; i++) Color[i] = data[i + 1];
		
	} else if (L_Type == 0x02) {
//		setLedOffset(data[0]);
	} else if (L_Type == 0x03) {
//		zoomValue = data[0];
	} else if (L_Type == 0x05) {
		if (data[0] != offsetValue) {
			offsetValue = data[0];
			setLedOffset(offsetValue);
		}
		if (data[1] != zoomValue) zoomValue = data[1];
		if (data[2] != slideValue) slideValue = (data[2] / 100.0) * 255;
	}
	wsUpdateMag();
}

void MusicMode(u8 type, u8 data[]) {
	u8 i;
	
	M_Type = type;
	mLevel = data[0];
	if (M_Type == 0x01) {
		for (i = 0; i < 3; i++) {
			if (mLevel == 0x03) {
				musicColor[0][i] = data[i + 1];
//				high_color[i] = data[i + 1];
			} else if (mLevel == 0x02) {
				musicColor[4][i] = data[i + 1];
				musicColor[5][i] = data[i + 1];
//				mid_color[i] = data[i + 1];
			} else if (mLevel == 0x01) {
				musicColor[9][i] = data[i + 1];
//				low_color[i] = data[i + 1];
			}
		}
		
		generateMusicColor(mLevel);
	} else if (M_Type == 0x02) {
//		setLedOffset(data[0]);
	} else if (M_Type == 0x04) {
		
	} else if (M_Type == 0x05) {
		if (data[0] != offsetValue) {
			offsetValue = data[0];
			setLedOffset(offsetValue);
		}
		if (data[1] != zoomValue) zoomValue = data[1];
		if (data[2] != slideValue) slideValue = (data[2] / 100.0) * 255;
	}
}

void Setting(u8 syncType, u8 data[]) {
	u8 i;
	u32 time = 0;
	
	sync = syncType;
					
	if (sync == 0xFF) {
		for (i = 0; i <= 3; i++) time += (data[3 - i] << (8 * i));
		Timestamp = time;
	}
	if (sync == 0xFE) {
		fft_mag = data[0];
	}
	if (sync == 0x01 || sync == 0x00) {
		if (sync == 0x01) {
			auto_OnOff[0] = 1;
			AutoOn.tm_hour = data[1];
			AutoOn.tm_min = data[2];
			AutoOn.tm_sec = data[3];
			
//			printf("Set Auto On => Days: %0X, %02d:%02d:%02d\r\n",
//				data[0], 
//				AutoOn.tm_hour, AutoOn.tm_min, AutoOn.tm_sec
//			);
		} else if (sync == 0x00) {
			auto_OnOff[1] = 1;
			AutoOff.tm_hour = data[1];
			AutoOff.tm_min = data[2];
			AutoOff.tm_sec = data[3];
			
//			printf("Set Auto Off => Days: %0X, %02d:%02d:%02d\r\n",
//				data[0], 
//				AutoOff.tm_hour, AutoOff.tm_min, AutoOff.tm_sec
//			);
		}
//		printf("Sun Sat Fri Thu Wed Tue Mon\r\n");
		for (i = 0; i < 7; i++) {
			weekdayEN[6 - i] = (data[0] >> i) & 0x01;
//			printf("%3d ", weekdayEN[6 - i]);
		}
//		printf("\r\n");
	}
//	printf("Timestamp: %d sec\r\n", Timestamp);
}

void BT_Module(u8 type, u8 data[]) {
	u8 i;
	
	if (type == 0x06) {
		
	} else if (type == 0x07) {
		BLE_TX[3] = data[0];
		BLE_TX[4] = data[1];
		for (i = 0; i < 7; i += 1) printf("%c", BLE_TX[i]);
		USART_IntConfig(HT_UART0, USART_INT_TXDE, ENABLE);
	}
}

void On_Effect(u8 wait, bool reverse) {
	const u8 grad_size = 9;
	u8 gradient[WS_LEV_SIZE * 2 + grad_size] = {
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		40, 25, 20, 17, 10, 8, 4, 2, 1,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0
	};
	u8 i, j;
	u8 start_index = 0;
	u32 w = 0;
	if (!reverse) {
		while (start_index < (WS_LEV_SIZE + grad_size)) {
			for (i = 0; i < WS_FRQ_SIZE; i++) {
				for (j = 0; j < WS_LEV_SIZE; j++) {
					wsSetColor(WS_LED[i][j], ws_white, gradient[start_index + j]);
				}
			}
			start_index += 1;
			w = wait * 10000;
			wsShow();
			while(w--);
		}
	} else {
		start_index = 0;
		while (start_index < (WS_LEV_SIZE + grad_size + 1)) {
			for (i = 0; i < WS_FRQ_SIZE; i++) {
				for (j = 0; j < WS_LEV_SIZE; j++) {
					wsSetColor(WS_LED[i][(WS_LEV_SIZE - 1) - j], ws_white, gradient[start_index + j]);
				}
			}
			start_index += 1;
			w = wait * 10000;
			wsShow();
			while(w--);
		}
	}
}

void Switch_Effect(u8 wait, u8 max_brightness) {
	u8 effect, mag;
	u32 w;
	
	effect = 0;
	mag = max_brightness / 16;
	while (effect < max_brightness) {
		if (mode == 2) Light_Animation(max_brightness - effect);
		else Music_Animation(max_brightness - effect);
		effect += mag;
		if (effect >= 254) effect = 254;
		w = (wait * 1000);
		wsShow();
		while(w--);
	}
	effect = 0;
//	if (mode == 2) max_brightness = Music.slide;
//	else max_brightness = Light.slide;
	while (effect < max_brightness) {
		if (mode == 3) Light_Animation(effect);
		else Music_Animation(effect);
		effect += mag;
		if (effect >= 254) effect = 254;
		w = (wait * 1000);
		wsShow();
		while(w--);
	}
}

void Light_Animation(u8 brightness) {
	u8 i, j;
	u8 *rows = showRows(zoomValue);
	
	for (i = 0; i < WS_FRQ_SIZE; i += 1) {
		for (j = 0; j < WS_LEV_SIZE; j += 1) {
			if (rows[i] == 1) wsSetColor(WS_LED[i][j], Color, brightness);
			else wsSetColor(WS_LED[i][j], ws_clean, 0);
		}
	}
}

void Music_Animation(u8 brightness) {
	const u8 o = 2;
	u8 i, j;
	u8 level;
	u8 *rows = showRows(zoomValue);
	u8 scale = WS_FRQ_SIZE / zoomValue;
	u8 exactOutput[WS_FRQ_SIZE] = {0}, n = 0;
	
//		printf("\r");
	for (i = 0; i < WS_FRQ_SIZE; i += 1) {
		if (i % scale == 0) {
			if (OutputSignal[i] < (o + 3)) level = 1;
			else if(OutputSignal[i] < (o + 5)) level = 2;
			else if(OutputSignal[i] < (o + 8)) level = 3;
			else if(OutputSignal[i] < (o + 11)) level = 4;
			else if(OutputSignal[i] < (o + 14)) level = 5;
			else if(OutputSignal[i] < 17) level = 6;
			else if(OutputSignal[i] < 20) level = 7;
			else if(OutputSignal[i] < 23) level = 8;
			else if(OutputSignal[i] < 26) level = 9;
			else level = 10;
			
			exactOutput[i / scale] = level;
//			printf("%-3.0f ", OutputSignal[i]);
		}
	}
		// set fft leds
	for (i = 0; i < WS_FRQ_SIZE; i += 1) {
		for (j = 0; j < WS_LEV_SIZE; j += 1) {
			//WS_LED[index][level]
			if (rows[i] == 1) {
				if (j < exactOutput[n]) wsSetColor(WS_LED[i][j], musicColor[j], brightness);
				else wsSetColor(WS_LED[i][j], musicColor[j], 0);
			} else {
				wsSetColor(WS_LED[i][j], musicColor[j], 0);
			}
			if((j == wsLevel[i] - 1) && rows[i] == 1) wsSetColor(WS_LED[i][j], musicColor[j], brightness);
		}
		// update drop down timer
		if(exactOutput[n] > wsLevel[i]) {
			wsLevel[i] = exactOutput[n];
			wsLevelTM[i] = 65;
		}
		if(wsLevelTM[i] == 0) {
			if(wsLevel[i] >= exactOutput[n]) wsLevel[i]--;
			wsLevelTM[i] = 10;
		}
		
		if (rows[i] == 1) n += 1;
	}
}

static void delay(u32 count) {
	while (count--) {
		__NOP(); // Prevent delay loop be optimized
	}
}


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
